In [15]:
"""
Create a DataFrame student_scores containing students' scores in three subjects: Math, 
Science, and English. Each row represents a student, and each column represents a subject. 
Perform the following operations:
"""
Student_Scores={
    "Student" :["Student1","Student2","Student3","Student4","Student5"],
    "Maths":[78,90,40,76,69],
    "Science":[68,90,57,76,90],
    "English":[78,50,70,65,69]

}

In [9]:
import pandas as pd

In [17]:
df=pd.DataFrame(Student_Scores)

In [19]:
df

    Student  Maths  Science  English
0  Student1     78       68       78
1  Student2     90       90       50
2  Student3     40       57       70
3  Student4     76       76       65
4  Student5     69       90       69

In [35]:
"""
Calculate the average score for each student and add it as a new column named 
"Average".
"""
df["Average"]=df[['Maths','Science','English']].mean(axis =1)

In [41]:
df

    Student  Maths  Science  English    Average
0  Student1     78       68       78  74.666667
1  Student2     90       90       50  76.666667
2  Student3     40       57       70  55.666667
3  Student4     76       76       65  72.333333
4  Student5     69       90       69  76.000000

In [43]:
# Find the student(s) with the highest average score.
df["Average"].max()

76.66666666666667

In [51]:
# Sort the DataFrame based on the average score in descending order.
df.sort_values(by="Average", ascending=False)

    Student  Maths  Science  English    Average
1  Student2     90       90       50  76.666667
4  Student5     69       90       69  76.000000
0  Student1     78       68       78  74.666667
3  Student4     76       76       65  72.333333
2  Student3     40       57       70  55.666667

In [ ]:
"""
Question 2
Create a list temperatures containing temperatures in Celsius. Convert these temperatures to 
Fahrenheit using a list comprehension and store the result in a new list named 
fahrenheit_temperatures.
"""

In [57]:
temperatures =[0,10,20,30,40,50]
fahrenheit_temperatures=[(temp*9/5)+32 for temp in temperatures]
fahrenheit_temperatures

[32.0, 50.0, 68.0, 86.0, 104.0, 122.0]